In [3]:
# birliktelik analizi
# markep sepet analizi - association rules - pazar sepet analizi

# apriori algoritmasi

# Apriori (Birliktelik Analizi)

In [4]:
pip install mlxtend

Collecting mlxtend
  Downloading mlxtend-0.17.2-py2.py3-none-any.whl (1.3 MB)
Requirement already satisfied: scikit-learn>=0.20.3 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (0.22.1)
Requirement already satisfied: pandas>=0.24.2 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (1.0.1)
Requirement already satisfied: numpy>=1.16.2 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (1.18.1)
Requirement already satisfied: setuptools in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (45.2.0.post20200210)
Requirement already satisfied: matplotlib>=3.0.0 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (3.1.3)
Requirement already satisfied: joblib>=0.13.2 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (0.14.1)
Requirement already satisfied: scipy>=1.2.1 in c:\users\ydran\anaconda3\lib\site-packages (from mlxtend) (1.4.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\ydran\anaconda3\lib\site-packages (from pandas>=0.24.2->mlxtend) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\ydran\anaconda3\lib\site-packages (from pandas>=0.24.2->mlxtend) (2019.3)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in c:\users\ydran\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (2.4.6)
Requirement already satisfied: cycler>=0.10 in c:\users\ydran\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\ydran\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\ydran\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.24.2->mlxtend) (1.14.0)
Installing collected packages: mlxtend
Successfully installed mlxtend-0.17.2
Note: you may need to restart the kernel to use updated packages.

## Data Understanding

In [4]:
import pandas as pd
import numpy as np

from mlxtend.frequent_patterns import apriori, association_rules

In [5]:
df = pd.read_csv("retail_dataset.csv")
df.head()

        0       1     2       3       4       5       6
0   Bread    Wine  Eggs    Meat  Cheese  Pencil  Diaper
1   Bread  Cheese  Meat  Diaper    Wine    Milk  Pencil
2  Cheese    Meat  Eggs    Milk    Wine     NaN     NaN
3  Cheese    Meat  Eggs    Milk    Wine     NaN     NaN
4    Meat  Pencil  Wine     NaN     NaN     NaN     NaN

In [6]:
df.shape

(315, 7)

In [7]:
df['0']

0       Bread
1       Bread
2      Cheese
3      Cheese
4        Meat
        ...
310     Bread
311      Meat
312     Bread
313      Meat
314      Eggs
Name: 0, Length: 315, dtype: object

In [11]:
items = (df["0"].unique())
items

array(['Bread', 'Cheese', 'Meat', 'Eggs', 'Wine', 'Bagel', 'Pencil',
       'Diaper', 'Milk'], dtype=object)

In [12]:
encoded_vals = []

for index, row in df.iterrows():
    
    labels = {}
    
    uncommons = list(set(items) - set(row))
    commons   = list(set(items).intersection(row))
    
    for uc in uncommons:
        labels[uc] = 0
        
    for com in commons:
        labels[com] = 1
        
    encoded_vals.append(labels)

In [16]:
encoded_vals[0]

{'Bagel': 0,
 'Milk': 0,
 'Pencil': 1,
 'Bread': 1,
 'Eggs': 1,
 'Cheese': 1,
 'Diaper': 1,
 'Wine': 1,
 'Meat': 1}

In [17]:
ohe_df = pd.DataFrame(encoded_vals)

In [19]:
ohe_df

     Bagel  Milk  Pencil  Bread  Eggs  Cheese  Diaper  Wine  Meat
0        0     0       1      1     1       1       1     1     1
1        0     1       1      1     0       1       1     1     1
2        0     1       0      0     1       1       0     1     1
3        0     1       0      0     1       1       0     1     1
4        0     0       1      0     0       0       0     1     1
..     ...   ...     ...    ...   ...     ...     ...   ...   ...
310      0     0       0      1     1       1       0     0     0
311      0     1       1      0     0       0       0     0     1
312      0     0       1      1     1       1       1     1     1
313      0     0       0      0     0       1       0     0     1
314      1     0       0      1     1       0       0     1     1

[315 rows x 9 columns]

## Association Rules

In [25]:
freq_items = apriori(ohe_df, min_support = 0.2, use_colnames = True, verbose = 1)
freq_items

Processing 144 combinations | Sampling itemset size 3

     support              itemsets
0   0.425397               (Bagel)
1   0.501587                (Milk)
2   0.361905              (Pencil)
3   0.504762               (Bread)
4   0.438095                (Eggs)
5   0.501587              (Cheese)
6   0.406349              (Diaper)
7   0.438095                (Wine)
8   0.476190                (Meat)
9   0.225397         (Bagel, Milk)
10  0.279365        (Bagel, Bread)
11  0.279365         (Milk, Bread)
12  0.244444          (Milk, Eggs)
13  0.304762        (Cheese, Milk)
14  0.219048          (Milk, Wine)
15  0.244444          (Milk, Meat)
16  0.200000       (Bread, Pencil)
17  0.200000      (Cheese, Pencil)
18  0.200000        (Wine, Pencil)
19  0.238095       (Cheese, Bread)
20  0.231746       (Diaper, Bread)
21  0.244444         (Bread, Wine)
22  0.206349         (Bread, Meat)
23  0.298413        (Cheese, Eggs)
24  0.241270          (Wine, Eggs)
25  0.266667          (Eggs, Meat)
26  0.200000      (Cheese, Diaper)
27  0.269841        (Cheese, Wine)
28  0.323810        (Cheese, Meat)
29  0.234921        (Diaper, Wine)
30  0.250794          (Wine, Meat)
31  0.203175  (Cheese, Milk, Meat)
32  0.215873  (Eggs, Cheese, Meat)

In [26]:
freq_items.head()

    support  itemsets
0  0.425397   (Bagel)
1  0.501587    (Milk)
2  0.361905  (Pencil)
3  0.504762   (Bread)
4  0.438095    (Eggs)

In [28]:
association_rules(freq_items, metric = "confidence", min_threshold = 0.6)

,antecedents,consequents,antecedent support,consequent support,support,confidence,lift,leverage,conviction
0,(Bagel),(Bread),0.425397,0.504762,0.279365,0.656716,1.301042,0.064641,1.442650
1,(Cheese),(Milk),0.501587,0.501587,0.304762,0.607595,1.211344,0.053172,1.270148
2,(Milk),(Cheese),0.501587,0.501587,0.304762,0.607595,1.211344,0.053172,1.270148
3,(Eggs),(Cheese),0.438095,0.501587,0.298413,0.681159,1.358008,0.078670,1.563203
4,(Eggs),(Meat),0.438095,0.476190,0.266667,0.608696,1.278261,0.058050,1.338624
5,(Wine),(Cheese),0.438095,0.501587,0.269841,0.615942,1.227986,0.050098,1.297754
6,(Cheese),(Meat),0.501587,0.476190,0.323810,0.645570,1.355696,0.084958,1.477891
7,(Meat),(Cheese),0.476190,0.501587,0.323810,0.680000,1.355696,0.084958,1.557540
8,"(Cheese, Milk)",(Meat),0.304762,0.476190,0.203175,0.666667,1.400000,0.058050,1.571429
9,"(Cheese, Meat)",(Milk),0.323810,0.501587,0.203175,0.627451,1.250931,0.040756,1.337845
10,"(Milk, Meat)",(Cheese),0.244444,0.501587,0.203175,0.831169,1.657077,0.080564,2.952137
11,"(Cheese, Eggs)",(Meat),0.298413,0.476190,0.215873,0.723404,1.519149,0.073772,1.893773
12,"(Meat, Eggs)",(Cheese),0.266667,0.501587,0.215873,0.809524,1.613924,0.082116,2.616667
13,"(Cheese, Meat)",(Eggs),0.323810,0.438095,0.215873,0.666667,1.521739,0.074014,1.685714

# RFM

## Data Understanding

In [31]:
import pandas as pd
import numpy as np
import seaborn as sns

In [56]:
#  to display all columns and rows:
pd.set_option("display.max_columns", None);
pd.set_option("display.max_rows", None);

# virgulden sonra gosterilecek olan sayi sayisi
pd.set_option("display.float_format", lambda x: "%.2f" % x)

In [57]:
df_2009_2010 = pd.read_excel("online_retail.xlsx", sheet_name = "Year 2009-2010")

In [59]:
df = df_2009_2010.copy()

In [60]:
# pandas bolumunde veriye ilk bakis olarak kullanilabilecek fonksiyonlari kullanarak veriyi anlamaya calisiniz
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom

In [61]:
# essiz urun sayisi nedir?
df["Description"].nunique()

4681

In [62]:
# hangi urunden kacar tane var?
df["Description"].value_counts().head()

WHITE HANGING HEART T-LIGHT HOLDER    3549
REGENCY CAKESTAND 3 TIER              2212
STRAWBERRY CERAMIC TRINKET BOX        1843
PACK OF 72 RETRO SPOT CAKE CASES      1466
ASSORTED COLOUR BIRD ORNAMENT         1457
Name: Description, dtype: int64

In [63]:
# en cok siparis edilen urun hangisidir
df.groupby("Description").agg({"Quantity":"sum"}).head()

                                     Quantity
Description
21494                                    -720
22467                                      -2
22719                                       2
  DOORMAT UNION JACK GUNS AND ROSES       179
 3 STRIPEY MICE FELTCRAFT                 690

In [48]:
# df[df.Invoice.str.contains("C")]

In [64]:
# yukaridaki ciktiyi nasil siralariz?
df.groupby("Description").agg({"Quantity":"sum"}).sort_values("Quantity", ascending = False).head()

                                    Quantity
Description
WHITE HANGING HEART T-LIGHT HOLDER     57733
WORLD WAR 2 GLIDERS ASSTD DESIGNS      54698
BROCADE RING PURSE                     47647
PACK OF 72 RETRO SPOT CAKE CASES       46106
ASSORTED COLOUR BIRD ORNAMENT          44925

In [65]:
# toplam kac fatura kesilmistir?
df["Invoice"].nunique()

28816

In [66]:
# fatura basina ortalama kac para kazanilmistir? 
df["TotalPrice"] = df["Quantity"] * df["Price"]

In [67]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom,83.40
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom,81.00
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom,81.00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom,100.80
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom,30.00

In [68]:
df.groupby("Invoice").agg({"TotalPrice":"sum"}).head()

         TotalPrice
Invoice
489434       505.30
489435       145.80
489436       630.33
489437       310.75
489438      2286.24

In [69]:
# en pahali urunler hangileridir?
df.sort_values("Price", ascending = False).head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
241824,C512770,M,Manual,-1,2010-06-17 16:52:00,25111.09,17399.00,United Kingdom,-25111.09
241827,512771,M,Manual,1,2010-06-17 16:53:00,25111.09,nan,United Kingdom,25111.09
320581,C520667,BANK CHARGES,Bank Charges,-1,2010-08-27 13:42:00,18910.69,nan,United Kingdom,-18910.69
517953,C537630,AMAZONFEE,AMAZON FEE,-1,2010-12-07 15:04:00,13541.33,nan,United Kingdom,-13541.33
519294,C537651,AMAZONFEE,AMAZON FEE,-1,2010-12-07 15:49:00,13541.33,nan,United Kingdom,-13541.33

In [70]:
# hangi ulkeden kac siparis geldi?
df["Country"].value_counts()

United Kingdom          485852
EIRE                      9670
Germany                   8129
France                    5772
Netherlands               2769
Spain                     1278
Switzerland               1187
Portugal                  1101
Belgium                   1054
Channel Islands            906
Sweden                     902
Italy                      731
Australia                  654
Cyprus                     554
Austria                    537
Greece                     517
United Arab Emirates       432
Denmark                    428
Norway                     369
Finland                    354
Unspecified                310
USA                        244
Japan                      224
Poland                     194
Malta                      172
Lithuania                  154
Singapore                  117
RSA                        111
Bahrain                    107
Canada                      77
Thailand                    76
Hong Kong                   76
Israel                      74
Iceland                     71
Korea                       63
Brazil                      62
West Indies                 54
Bermuda                     34
Nigeria                     32
Lebanon                     13
Name: Country, dtype: int64

In [71]:
# hangi ulke ne kadar kazandirdi?
df.groupby("Country").agg({"TotalPrice":"sum"}).head()

           TotalPrice
Country
Australia    30051.80
Austria      13023.28
Bahrain       2313.15
Belgium      22663.53
Bermuda       1253.14

In [73]:
df.groupby("Country").agg({"TotalPrice":"sum"}).sort_values("TotalPrice", ascending = False).head()

                TotalPrice
Country
United Kingdom  8194777.53
EIRE             352242.73
Netherlands      263863.41
Germany          196290.35
France           130769.90

In [74]:
# en cok iade alan urun hangisidir???

## Data Preparation

In [75]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
TotalPrice          0
dtype: int64

In [76]:
df.dropna(inplace = True)

In [77]:
df.shape

(417534, 9)

In [78]:
df.describe([0.01, 0.05, 0.10, 0.25, 0.50, 0.75, 0.90, 0.95, 0.99]).T

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
Quantity,417534.00,12.76,101.22,-9360.00,-2.00,1.00,1.00,2.00,4.00,12.00,24.00,36.00,144.00,19152.00
Price,417534.00,3.89,71.13,0.00,0.29,0.42,0.65,1.25,1.95,3.75,6.75,8.50,14.95,25111.09
Customer ID,417534.00,15360.65,1680.81,12346.00,12435.00,12725.00,13042.00,13983.00,15311.00,16799.00,17706.00,17913.00,18196.00,18287.00
TotalPrice,417534.00,19.99,99.92,-25111.09,-11.25,1.10,1.70,4.25,11.25,19.35,35.40,65.40,196.20,15818.40

In [80]:
for feature in ["Quantity", "Price", "TotalPrice"]:
    
    Q1 = df[feature].quantile(0.01)
    Q3 = df[feature].quantile(0.99)
    IQR = Q3 - Q1
    upper = Q3 + 1.5 * IQR
    lower = Q1 - 1.5 * IQR
    
    if df[(df[feature] > upper) | (df[feature] < lower)].any(axis = None):
        print(feature, "yes")
        print(df[(df[feature] > upper) | (df[feature] < lower)].shape[0])
    else:
        print(feature, "no")

Quantity yes
1063
Price yes
953
TotalPrice yes
1150

## RFM Skorlari ile Musteri Segmentasyonu

In [81]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.00,United Kingdom,83.40
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom,81.00
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.00,United Kingdom,81.00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.00,United Kingdom,100.80
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.00,United Kingdom,30.00

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417534 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      417534 non-null  object
 1   StockCode    417534 non-null  object
 2   Description  417534 non-null  object
 3   Quantity     417534 non-null  int64
 4   InvoiceDate  417534 non-null  datetime64[ns]
 5   Price        417534 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      417534 non-null  object
 8   TotalPrice   417534 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 31.9+ MB

In [85]:
df["InvoiceDate"].min()

Timestamp('2009-12-01 07:45:00')

In [86]:
df["InvoiceDate"].max()

Timestamp('2010-12-09 20:01:00')

In [87]:
import datetime as dt
today_date = dt.datetime(2010, 12, 9)

In [88]:
today_date

datetime.datetime(2010, 12, 9, 0, 0)

In [95]:
df["Customer ID"] = df["Customer ID"].astype(int)
df.groupby("Customer ID").agg({"InvoiceDate":"max"}).head()

                    InvoiceDate
Customer ID
12346       2010-10-04 16:33:00
12347       2010-12-07 14:57:00
12348       2010-09-27 14:59:00
12349       2010-10-28 08:23:00
12351       2010-11-29 15:23:00

In [97]:
(today_date - df.groupby("Customer ID").agg({"InvoiceDate":"max"})).head()

                 InvoiceDate
Customer ID
12346       65 days 07:27:00
12347        1 days 09:03:00
12348       72 days 09:01:00
12349       41 days 15:37:00
12351        9 days 08:37:00

In [98]:
temp_df = (today_date - df.groupby("Customer ID").agg({"InvoiceDate":"max"}))

In [99]:
temp_df.rename(columns = {"InvoiceDate":"Recency"}, inplace = True)

In [100]:
temp_df.head()

                     Recency
Customer ID
12346       65 days 07:27:00
12347        1 days 09:03:00
12348       72 days 09:01:00
12349       41 days 15:37:00
12351        9 days 08:37:00

In [101]:
recency_df = temp_df["Recency"].apply(lambda x: x.days)

In [102]:
recency_df.head()

Customer ID
12346    65
12347     1
12348    72
12349    41
12351     9
Name: Recency, dtype: int64

In [104]:
df.groupby("Customer ID").agg({"InvoiceDate": lambda x: (today_date - x.max()).days}).head()

             InvoiceDate
Customer ID
12346                 65
12347                  1
12348                 72
12349                 41
12351                  9

### Frequency

In [106]:
temp_df = df.groupby(["Customer ID", "Invoice"]).agg({"Invoice":"count"})

In [107]:
temp_df.head()

                     Invoice
Customer ID Invoice
12346       491725         1
            491742         1
            491744         1
            492718         1
            492722         1

In [109]:
temp_df.groupby("Customer ID").agg({"Invoice":"sum"}).head()

             Invoice
Customer ID
12346             46
12347             71
12348             20
12349            107
12351             21

In [110]:
freq_df = temp_df.groupby("Customer ID").agg({"Invoice":"sum"})
freq_df.rename(columns = {"Invoice":"Frequency"}, inplace = True)
freq_df.head()

             Frequency
Customer ID
12346               46
12347               71
12348               20
12349              107
12351               21

### Monetary

In [113]:
monetary_df = df.groupby("Customer ID").agg({"TotalPrice":"sum"})
monetary_df.head()

             TotalPrice
Customer ID
12346            -64.68
12347           1323.32
12348            222.16
12349           2646.99
12351            300.93

In [114]:
monetary_df.rename(columns = {"TotalPrice":"Monetary"}, inplace = True)

In [116]:
print(recency_df.shape, freq_df.shape, monetary_df.shape)

(4383,) (4383, 1) (4383, 1)

In [117]:
rfm = pd.concat([recency_df, freq_df, monetary_df], axis = 1)

In [118]:
rfm.head()

             Recency  Frequency  Monetary
Customer ID
12346             65         46    -64.68
12347              1         71   1323.32
12348             72         20    222.16
12349             41        107   2646.99
12351              9         21    300.93

In [136]:
pd.qcut(rfm["Recency"], 5, labels = [5, 4, 3, 2, 1]).head()

Customer ID
12346    3
12347    5
12348    2
12349    3
12351    5
Name: Recency, dtype: category
Categories (5, int64): [5 < 4 < 3 < 2 < 1]

In [137]:
pd.qcut(rfm["Frequency"], 5, labels = [1, 2, 3, 4, 5]).head()

Customer ID
12346    3
12347    4
12348    2
12349    4
12351    2
Name: Frequency, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [138]:
pd.qcut(rfm["Monetary"], 5, labels = [1, 2, 3, 4, 5]).head()

Customer ID
12346    1
12347    4
12348    1
12349    5
12351    2
Name: Monetary, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [149]:
rfm["RecencyScore"]   = pd.qcut(rfm["Recency"],   5, labels = [5, 4, 3, 2, 1])
rfm["FrequencyScore"] = pd.qcut(rfm["Frequency"], 5, labels = [1, 2, 3, 4, 5])
rfm["MonetaryScore"]  = pd.qcut(rfm["Monetary"],  5, labels = [1, 2, 3, 4, 5])

In [150]:
rfm.head()

,Recency,Frequency,Monetary,RecencyScore,FrequencyScore,MonetaryScore
Customer ID,,,,,,
12346,65,46,-64.68,3,3,1
12347,1,71,1323.32,5,4,4
12348,72,20,222.16,2,2,1
12349,41,107,2646.99,3,4,5
12351,9,21,300.93,5,2,2

In [151]:
( rfm["RecencyScore"].astype(str) + 
  rfm["FrequencyScore"].astype(str) + 
  rfm["MonetaryScore"].astype(str) ).head()

Customer ID
12346    331
12347    544
12348    221
12349    345
12351    522
dtype: object

In [152]:
rfm.isnull().sum()

Recency           0
Frequency         0
Monetary          0
RecencyScore      0
FrequencyScore    0
MonetaryScore     0
dtype: int64